
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.appinsights)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "3fcab30a-eeac-48ae-87e0-ac1881c9a034" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/xui-mo-webapp-aat/providers/Microsoft.Insights/components/xui-mo-webapp-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "xui-mo-webapp-appinsights-aat"
        tags                                  = {
            "application"         = "expert-ui"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-manage-organisations.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "staging"
            "managedBy"           = "Expert UI"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" # forces replacement
        # (10 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1226,"Program":"tfcmt","SHA1":"","Vars":{}} -->